{
  "_production_test": "full_quality_gemini_gem",
  "company_name": "Acme Holdings Inc",
  "proposal_type": "Digital Marketing Proposal",
  "executive_summary": "Acme Holdings Inc is seeking to expand their digital presence and increase lead generation through a comprehensive digital marketing strategy. This proposal outlines our recommended approach to achieve measurable growth in the next 6 months.",
  "sections": [
    {
      "title": "What We Learned",
      "content": [
        {
          "label": "Current State",
          "text": "Limited organic search presence beyond branded keywords. Website traffic is primarily direct, with minimal inbound lead generation."
        },
        {
          "label": "Goals",
          "text": "Increase qualified leads by 150% and establish thought leadership in the financial services industry."
        },
        {
          "label": "Challenges",
          "text": "Highly competitive keywords, long sales cycles, and need for compliance-friendly content."
        }
      ],
      "quote": "We need a partner who understands both marketing and our industry constraints.",
      "quote_author": "Jane Smith, CMO"
    },
    {
      "title": "How We Can Help",
      "items": [
        {
          "area": "SEO Strategy",
          "finding": "Current website lacks topical authority and technical optimization",
          "opportunity": "Build content hub around financial planning topics, improve site speed, and implement structured data"
        },
        {
          "area": "Paid Search",
          "finding": "No current paid campaigns running",
          "opportunity": "Launch targeted Google Ads campaigns for high-intent keywords with conversion-optimized landing pages"
        },
        {
          "area": "Content Marketing",
          "finding": "Blog exists but lacks consistency and strategic focus",
          "opportunity": "Develop editorial calendar with weekly posts targeting decision-makers in target segments"
        }
      ]
    },
    {
      "title": "Tactical Plan",
      "phases": [
        {
          "timeframe": "Month 1",
          "phase": "Foundation",
          "activities": "SEO audit, keyword research, competitor analysis, content strategy development, analytics setup"
        },
        {
          "timeframe": "Months 2-3",
          "phase": "Launch",
          "activities": "Technical SEO fixes, content creation (8-10 articles), paid search campaigns launch, conversion tracking"
        },
        {
          "timeframe": "Months 4-6",
          "phase": "Optimize & Scale",
          "activities": "Ongoing content, campaign optimization, link building, monthly reporting and strategy refinement"
        }
      ]
    },
    {
      "title": "Investment",
      "pricing_options": [
        {
          "name": "Essential",
          "subtitle": "Foundation + SEO Focus",
          "price": "$5,000/month",
          "description": "SEO strategy, technical optimization, content creation (4 posts/month), monthly reporting",
          "recommended": false
        },
        {
          "name": "Growth",
          "subtitle": "Essential + Paid Acquisition",
          "price": "$8,500/month",
          "description": "Everything in Essential, plus Google Ads management ($3K ad spend included), landing page optimization, weekly reporting",
          "recommended": true
        },
        {
          "name": "Enterprise",
          "subtitle": "Full-Service Growth",
          "price": "$12,000/month",
          "description": "Everything in Growth, plus LinkedIn campaigns, marketing automation setup, dedicated account manager",
          "recommended": false
        }
      ],
      "setup_fee": "$4,500 one-time setup fee for initial audit, strategy, and platform configuration"
    }
  ]
}
